app/controllers/tasks_controller.rb

SELECT * FROM `tasks`
---
  def index
    @tasks = Task.all

INSERT INTO `tasks` (`created_at`, `title`, `updated_at`, `description`) VALUES('2010-03-21 19:34:20', 'Nowe', '2010-03-21 19:34:20', '')
---
    task = Task.new(params[:task])
    task.save

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)
---
  def show
    @task = Task.find(params[:id])